package ForLoop;

public class increment_decrement_demo {
    public static void main(String[] args) {
         int n = 6;
         int b = 4;
         // n++ първо използваме стойността и при следващо използване = +1
        // ++n увеличаваме стойността веднага и оттук нататък я използваме
        // n-- първо използваме стойността и при следващо използване = -1
        // --n намаляваме стойността веднага и оттук нататък я използваме

        System.out.println(n++ + --b - b-- + ++n);
        /* n++ се използва за 6, но при следващото споменаване на n ще е 7
        --b се изпълнява веднага(4-1 = 3) и оттук нататък е 3
        b-- вече е равна на 3, но при следващото споменаване ще е равна на 2
        ++n (събираме 1 с новата вече стойност на n = 7) е равно на 8
        целият израз е равен на: 6+3-3+8 = 14
         */
        System.out.println(n-- + --n + b--);
        /* тук n вече е 8 от горния пример
        логика: (n--) 8 използваме оттук нататък е 7
        + (--n) вече е 7 и вадим 1 = 6
        + (b--) 2 използваме, но оттук нататък е 1
        целият израз: 8+6+2 = 16
         */
    }
}
