package ForLoop;

public class summary_00 {
    public static void main(String[] args) {

        int n = 6;
        int b = 4;

        // Инкрементация  ++
        // Декрементация  --

        //System.out.println(n++ + --b - b-- + ++n);
        //System.out.println(n-- + --n + b--);


        //      начало  | условие за край | стъпка/промяна
        for (int number = 1; number <= 12; number++) {

            // действие
            System.out.println(number);

        }

        // Как работи фор цикъла:
        // 1. Декларираме старт - променливата
        // 2. Проверка дали сме достигнали края на цикъла
        // 3. Изпълнение на блока от код в тялото на цикъла
        // 4. Промяна на стойността на променливата

        //ВАЖНО: Стъпка 1 се изпълнява само веднъж в началото на цикъла
        //ВАЖНО: Цикличността се проявява в стъпки 2 - 4
        //ВАЖНО: Всяко завъртане на цикъла се нарича итерация


        String text = "Viko";

        //Дължината на текста
        System.out.println(text.length()); // 4

        //Символ по индекс - първа буква
        System.out.println(text.charAt(0));

        //Символ по индекс - последна буква
        System.out.println(text.charAt(text.length() - 1));

        //ВАЖНО: индексирането/броенето в Стринг започва от 0
    }
}